/* The title of the button for aborting the scanning of Audio Units. */
"Abort" = "Перервати";

/* alert button
   dialog confirmation */
"OK" = "OK";

/* alert button */
"Abort scan" = "Перервати пошук";

/* alert button */
"Continue" = "Продовжити";

/* alert button */
"Continue scan" = "Продовжити пошук";

/* alert button */
"Ignore" = "Ігнорувати";

/* alert button */
"Ignore plug-in" = "Ігнорувати плагін";

/* alert button */
"Open plug-in graphic interface" = "Відкрити графічний інтерфейс плагіна";

/* alert button */
"Start Plug-In Manager" = "Відкрити менеджер плагінів";

/* alert text */
"Dear ^P user,\nyou have %ld Audio Unit(s) enabled which did not pass the Apple AU validation. This may cause problems and can even crash ^P or lead to data loss! Please check with the manufacturer(s) for updated versions. We recommend disabling these plug-ins in the Plug-In Manager." = "Шановний користувач ^P,\nви ввімкнули кілька аудіоблоків (%ld), які не пройшли перевірку Apple AU. Це може спричинити проблеми та навіть призвести до збою ^P і втрати даних. Зверніться до виробника, щоб отримати оновлені версії. Рекомендуємо вимкнути ці плагіни в менеджері плагінів.";

/* alert text */
"Only Audio Units that have been successfully scanned will be available in ^P.\nScanning will continue next time you launch ^P." = "Тільки знайдені Audio Units будуть доступні у ^P.\nПошук буде продовжено після наступного запуску ^P.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection." = "Звуковий модуль «%1$@», створений «%2$@», сповіщає, що він не авторизований для використання в цій системі.\nДивіться відомості про захист від копіювання в документації плагіна.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection. You may open the plug-in’s graphic interface now for managing copy protection." = "Звуковий модуль «%1$@», створений «%2$@», сповіщає, що він не авторизований для використання в цій системі.\nДивіться відомості про захист від копіювання в документації плагіна. Можна відкрити графічний інтерфейс плагіна для врегулювання питань захисту від копіювання.";

/* alert text */
"While verifying Audio Unit compatibility, ^P encountered %ld Audio Unit plug-in(s) which did not pass the Apple AU validation. These plug-ins have been excluded from further usage in ^P to prevent possible problems or crashes. You can start the Plug-In Manager now to review the validation results or continue the startup process." = "Під час перевірки сумісності звукового модуля в ^P виявлено плагіни звукового модуля (%ld), які не пройшли перевірку Apple AU. Ці плагіни більше не використовуватимуться в ^P, щоб уникнути ймовірних проблем або аварій. Ви можете запустити менеджер плагінів, щоб переглянути результати перевірки, або продовжте процес запуску.";

/* alert text */
"^P unexpectedly quit while trying to use the Audio Unit “%@” by “%@”.\nThis plug-in may require an update." = "Програма ^P несподівано припинила роботу після спроби використання звукового модуля «%1$@», створеного «%2$@».\nМожливо, цей плагін потребує оновлення.";

/* alert title */
"An error has occurred with an installed Audio Unit plug-in." = "Сталася помилка з інстальованим плагіном звукового модуля.";

/* alert title */
"Audio Unit authorization error." = "Помилка авторизації звукового модуля.";

/* alert title */
"Incompatible Audio Units found." = "Знайдено несумісні Audio Units.";

/* alert title */
"You are about to abort the scan process." = "Ви збираєтеся перервати процес сканування.";

/* alert title */
"You are using incompatible Audio Units." = "Ви використовуєте несумісні Audio Units.";

/* audio unit type */
"MIDI processor" = "Процесор MIDI";

/* audio unit type */
"MIDI-controlled effect" = "Ефект із керуванням MIDI";

/* audio unit type */
"effect" = "ефект";

/* audio unit type */
"format converter" = "перетворювач форматів";

/* audio unit type */
"generator" = "генератор";

/* audio unit type */
"instrument" = "інструмент";

/* audio unit type */
"mixer" = "мікшер";

/* audio unit type */
"offline effect" = "автономний ефект";

/* audio unit type */
"output unit" = "модуль виходу";

/* audio unit type */
"panner" = "панорамувальник";

/* message while starting up */
"Searching for Audio Unit plug-ins…" = "Шукаю плагіни звукових модулів…";

/* message while starting up */
"Updating information about Audio Unit plug-ins…" = "Оновлюю відомості про плагіни звукових модулів…";

/* possible validation result */
"couldn’t be opened" = "не вдалося відкрити";

/* possible validation result */
"crashed validation" = "аварія під час перевірки";

/* possible validation result */
"failed validation" = "перевірку не пройдено";

/* possible validation result */
"not authorized" = "не авторизований";

/* possible validation result */
"not validated due to internal error" = "перевірку не виконано через внутрішню помилку";

/* possible validation result */
"not yet validated" = "ще не перевірено";

/* possible validation result */
"successfully validated" = "перевірено успішно";

/* progress dialog text */
"Scanning Audio Units (finalized %d of %d)" = "Сканування Audio Units (завершено %1$d із %2$d)";

/* progress dialog text */
"Scanning Audio Units (finalized %ld of %ld)" = "Сканую Audio Units (завершено %1$ld із %2$ld)";

/* used for invalid version numbers */
"invalid" = "некоректна";

/* used when value transformer can’t interpret given object */
"unknown" = "невідомо";
